{
  "newspapers": {
    "bbc": {
      "rss": "http://feeds.bbci.co.uk/news/rss.xml",
      "link": "https://www.bbc.com/news",
      "articles": [
        {
          "link": "https://www.bbc.com/news/articles/ckg7gl4zegyo",
          "published": "2025-06-16T01:27:42",
          "title": "Trump told Israel not to kill Iran's supreme leader",
          "text": "Trump told Israel not to kill Iran's supreme leader - report\n\nDuring an interview with Fox News, Netanyahu did not directly confirm or deny a report from Reuters that Trump had vetoed a plan to kill the ayatollah.\n\nThe conversation is said to have happened since Israel launched its attack on Iran on Friday.\n\nTrump reportedly told Israeli Prime Minister Benjamin Netanyahu that assassinating Khamenei was \"not a good idea\", according to one official. The president has not commented publicly on the report.\n\nUS President Donald Trump rejected a plan by Israel to kill Iran's Supreme Leader Ayatollah Ali Khamenei, three US officials have told BBC's US partner CBS News.\n\n\"There's so many false reports of conversations that never happened and I'm not going to get into that,\" the Israeli prime minister said.\n\n\"But I can tell you I think we do what we need to do. We will do what we need to do and I think the United States knows what is good for the United States and I'm just not going to get into it.\"\n\nAn Israeli official told CBS News that \"in principle\" Israel does not \"kill political leaders, we are focused on nuclear and military. I don't think anyone making decisions about those programs should be living free and easy\".\n\nIsrael first launched an attack on Iranian nuclear infrastructure and other targets on Friday. The two countries have continued to launch massive strikes at each other since, with attacks entering a third day on Sunday.\n\nIn his latest post on Truth Social about the escalating situation in the Middle East, Trump said \"Iran and Israel should make a deal\", adding that he would get the two to cease hostilities \"just like I got India and Pakistan\" - referring to the recent confrontation between the countries.\n\nSpeaking to reporters before leaving for the G7 summit in Canada, Trump said the US would continue to support Israel and declined to say if he had asked the country to stop its strikes on Iran.\n\nThe next round of US-Iran nuclear talks were initially scheduled to take place on Sunday, but mediator, Oman's foreign minister Badr Albusaidi, announced a day earlier that they had been cancelled.\n\nIran told Qatar and Oman that it was not open to negotiating a ceasefire while it was still under Israeli attack, an official briefed on the communications told the Reuters news agency on Sunday.\n\nTrump said on Saturday that the US \"had nothing to do with the attack on Iran\".\n\n\"If we are attacked in any way, shape or form by Iran, the full strength and might of the U.S. Armed Forces will come down on you at levels never seen before,\" he warned."
        },
        {
          "link": "https://www.bbc.com/news/articles/c8xgxdr01wro",
          "published": "2025-06-15T21:57:31",
          "title": "'Nowhere feels safe': Iranians on life under Israeli attacks",
          "text": "'Nowhere feels safe': Iranians on life under Israeli attacks\n\n\"Stuck\". That is the word most people who have spoken to the BBC use to describe life in Iran right now.\n\nAfter three days of Israeli attacks, \"everyone is trying to escape\" Tehran \"one way or another,\" one resident told BBC News Persian.\n\nOn Sunday, long queues formed at petrol stations across the city. Many people tried to leave for remote areas, away from any possible Israeli target, but could not even get out of the province because of heavy traffic.\n\n\"Tehran isn't safe, clearly,\" one resident said. \"We get no alarms or warnings from officials about Israeli attacks. We just hear the blasts and hope our place isn't hit. But where can we go? Nowhere feels safe.\"\n\nOne person who managed to move from Tehran to another province said: \"I don't think I've fully processed that I'm living in an active war zone, and I'm not sure when I'll reach acceptance.\"\n\n\"This is not my war. I'm not rooting for either side, I just want to survive along with my family.\"\n\nSince Friday, Israel hit Iran with its biggest wave of air strikes in years.\n\nIsrael's strikes have led to retaliation from Iran, which has launched missile attacks on Israel.\n\nAt least 10 people have been killed in Israel, authorities said. Iranian media, citing the health ministry, reported that 128 people had been killed in Israeli attacks as of midday on Saturday.\n\nOne Iranian told the BBC she has not been able to sleep for two nights: \"I've gone through really tough situations.\"\n\nShe said the current situation reminds her of bombings and going to shelters during the Iran-Iraq war of the 1980s, when she was a child.\n\n\"The difference is that back then, at least when an attack happened, we heard the air raid siren or at least warnings before it happened. But now, during this bombing or any air raid, there's no sirens or warnings.\"\n\nYounger people, born after the war, do not know what it was like, BBC News Persian's Ghoncheh Habibiazad said.\n\nOne woman in Tehran said she has considered leaving the city to escape the attacks.\n\n\"We've all wanted to go to smaller cities or villages, anywhere we can go, but each of us has loved ones who can't leave, and we're thinking of them,\" she said. \"What we're experiencing is not fair to any of us, the people of Iran.\"\n\n\"We're all trying to get through these days in fear, exhaustion, and a lot of stress, this is extremely hard and painful.\"\n\nOne resident in the capital said: \"I can't just leave Tehran. I can't leave my elderly parents who can't travel far and long and leave the city myself. Besides, I need to show up to work. What can I do now?\""
        },
        {
          "link": "https://www.bbc.com/news/articles/c1kvk8jpy3vo",
          "published": "2025-06-15T15:19:10",
          "title": "UK Foreign Office advises Britons to avoid travelling to Israel",
          "text": "UK advises against all travel to Israel as airstrikes continue\n\nA passenger hall at Ben Gurion International Airport in northern Israel was empty on Friday\n\n\"The situation has the potential to deteriorate further, quickly and without warning,\" it said.\n\nThe Foreign, Commonwealth and Development Office advice, which covers Israel and the Occupied Palestinian Territories, comes after missiles were launched by both countries in recent days. Israel's airspace remains closed.\n\nThe UK has advised Britons against all travel to Israel amid an escalation in the country's military activity with Iran.\n\nThose already in Israel or the Occupied Territories have been told to follow the advice of local authorities.\n\nThe new notice from the FCDO referred to the risks of regional escalation.\n\nPrevious advice had told Britons to avoid \"all travel to parts of Israel\".\n\nThis was updated to warn against \"all but essential travel\" to the country after a state of emergency was declared on 13 June.\n\nForeign Secretary David Lammy posted on X: \"My message to British nationals there is clear - your safety remains our top priority.\"\n\nThe FCDO also advises against all travel to Iran.\n\nBritish grandfather James Eden flew to Israel on 9 June for a six-day Christian pilgrimage and said he was stranded in Jerusalem.\n\nHe said the FCDO \"rang me and said there wasn't a lot they could do\", adding that all they could do was \"send out alerts and keep track\" of British nationals in the country.\n\nThe 72 year old, from Newcastle-upon-Tyne, told PA news agency he was considering travelling to Egypt to get a flight back to the UK but that the FCDO was \"not going to help me get out of Egypt either\".\n\nA FCDO spokesperson said it was \"in contact with a British man in Israel\" and was \"ready to support British nationals 24/7\", adding that it urged any in the region \"to monitor updates to FCDO Travel Advice\".\n\nThe FCDO is also advising British nationals against all travel to parts of Egypt.\n\nIsrael launched a new attack on Iran on the night of 12 June, saying its targets were military infrastructure including nuclear sites.\n\nIran subsequently launched retaliatory airstrikes and tensions proceeded to escalate between the two countries.\n\nAreas of Bat Yam and Tamra were hit by Iranian missiles on Saturday night, while the Israeli military said they struck more than 80 targets in Tehran overnight.\n\nOver the weekend, the UK government confirmed it was sending more RAF jets to the Middle East - a move the chancellor described as a \"precautionary measure\".\n\nMeanwhile, oil prices surged on Friday after concerns the conflict could disrupt supplies coming from the energy-rich region."
        },
        {
          "link": "https://www.bbc.com/news/videos/c8rermxkx75o",
          "published": "2025-06-15T20:38:53",
          "title": "Israeli paramedics on the ground of missile strike in Haifa",
          "text": "Israeli paramedics have been attending the site of an Iranian missile strike in Haifa.\n\nFootage from Reuters and The Associated Press shows burning cars and emergency vehicles on the scene."
        }
      ]
    },
    "cnn": {
      "rss": "http://rss.cnn.com/rss/cnn_topstories.rss",
      "link": "https://www.cnn.com",
      "articles": [
        {
          "link": "https://www.cnn.com/business/live-news/fox-news-dominion-trial-04-18-23/index.html",
          "published": "2023-04-19T13:44:51",
          "title": "Settlement reached in Fox vs Dominion lawsuit",
          "text": "Justin Nelson, Dominion's lead counsel, appears on CNN. (CNN)\n\nDominion Voting Systems had two goals in its defamation case against Fox News — accountability and “trying to make Dominion whole,” said Justin Nelson, the lead counsel election technology company.\n\nBoth were accomplished in this settlement, he told CNN on Tuesday.\n\nThe payment of more than $787 million by Fox News to Dominion and the network’s statement acknowledging that its coverage of the 2020 election was false was “a strong message of accountability” and an important victory for the employees of his client’s company.\n\n“This is really the first time that anyone has paid a price for telling the lies of the 2020 election and we’re very proud about that,” he said.\n\nWhile the settlement does not stipulate that Fox’s anchors must acknowledge the lies on air, Nelson said it was a consequential outcome for the network.\n\nThe texts and emails that emerged during the litigation process from inside the Fox network were valuable, he said. “And what today has shown is that you have to pay a price if you’re telling lies.”\n\nPrevious court filings revealed messages that showed that the most prominent stars and highest-ranking executives at Fox News privately ridiculed claims of election fraud in the 2020 election, despite the right-wing channel allowing lies about the presidential contest to be promoted on its air.\n\n“It’s a lot of what we teach our kids, which is that the truth does indeed matter, and if you are lying, eventually there’s going to be consequences to that,” Nelson said.\n\nHe said the settlement with Fox sends a “strong message” to other right-wing outlets in which Dominion has ongoing legal disputes."
        },
        {
          "link": "https://www.cnn.com/2023/04/17/media/dominion-fox-news-allegations/index.html",
          "published": "2023-04-17T17:01:11",
          "title": "Here are the Fox broadcasts and tweets Dominion says were defamatory",
          "text": "CNN —\n\nFor all the interest in big-name witnesses and eye-opening private text messages, at the core of the defamation lawsuit filed by Dominion Voting Systems against Fox News are 20 specific broadcasts and tweets in which the voting company says Fox knowingly promoted lies, destroying its reputation.\n\nAccording to the lawsuit, all 20 statements took place between November 8, 2020, and January 26, 2021, and came in the form of on-air comments from Fox hosts Jeanine Pirro, Lou Dobbs and Maria Bartiromo; interviews with prominent pro-Trump election deniers Sidney Powell, Rudy Giuliani and Mike Lindell; and several of Dobbs’ tweets.\n\nThe wild allegations in the statements fell into four broad categories: that Dominion conducted election fraud, that it used algorithms to flip votes, that it had ties to Venezuela and that politicians received kickbacks to use the company.\n\nThe judge overseeing the defamation trial has already ruled that these allegations were false, saying it is “CRYSTAL clear that none of the Statements relating to Dominion about the 2020 election are true.”\n\nAt trial, it will be a jury’s job to determine if the statements were made with “actual malice” – a high bar based on knowing falseness or having a reckless disregard for the truth – and potentially award damages. Dominion has asked for $1.6 billion in damages and additional punitive damages, a number Fox says is wildly overblown.\n\nFox has denied wrongdoing and said the case is a meritless assault on press freedoms. Lawyers for Fox have argued that Dominion hasn’t come close to clearing the high bar to prove defamation.\n\nHere’s a closer look at those 20 specific broadcasts and tweets of alleged defamation.\n\nBroadcast 1: Bartiromo interviews Powell\n\nMaria Bartiromo is involved in three broadcasts that Dominion says were defamatory. Roy Rochlin/Getty Images\n\nThe broadcast: “Sunday Morning Futures” on November 8, 2020.\n\nWhat they alleged: Election fraud and algorithm flips.\n\nKey false quote: “Sidney, we talked about the Dominion software. I know that there were voting irregularities. Tell me about that,” Bartiromo said.\n\n“That’s to put it mildly. The computer glitches could not and should not have happened at all,” Powell said. “That is where the fraud took place where they were flipping votes in the computer system or adding votes that did not exist.”\n\nBroadcast 2: Dobbs interviews Giuliani\n\nThe broadcast: “Lou Dobbs Tonight” on November 12, 2020.\n\nWhat they alleged: Election fraud and Venezuela ties.\n\nKey false quote: “So, we’re using a foreign company that is owned by Venezuelans who are close to – were close to (Hugo) Chávez, are now close to (Nicolás) Maduro, have a history. They were founded as a company to fix elections, they have a terrible record, and they are extremely hackable,” Giuliani said.\n\nBroadcast 3: Dobbs interviews Powell\n\nThe broadcast: “Lou Dobbs Tonight” on November 13, 2020.\n\nWhat they alleged: Election fraud, algorithm flips, Venezuela ties, kickbacks.\n\nKey false quote: “Let’s start with Dominion, a straight out disavowal of any claim of fraud against the company, its software or machines. Your reaction,” Dobbs asked.\n\n“Well, I can hardly wait to put forth all the evidence we have collected on Dominion, starting with the fact it was created to produce altered voting results in Venezuela for Hugo Chavez and then shipped internationally to manipulate votes for purchase in other countries, including this one,” Powell said.\n\n“We also need to look at and we’re beginning to collect evidence on the financial interests of some of the governors and Secretaries of State who actually bought into the Dominion Systems … to line their own pockets by getting a voting machine in that would either make sure their election was successful or they got money for their family from it,” she added.\n\n“Well, that’s straightforward,” Dobbs said. “You’re going to have to be quick to go through and to produce that investigation and the results of it.”\n\nBroadcast 4: Tweet from Dobbs\n\nLou Dobbs was involved in 12 allegedly defamatory statements, Dominion said in its lawsuit. Steven Ferdman/Getty Images\n\nThe broadcast: Quote-tweet by Dobbs of Giuliani tweet on November 14, 2020.\n\nWhat they alleged: Election fraud, algorithm flips, Venezuela ties.\n\nKey false quote: “Did you know a foreign company, DOMINION, was counting our vote in Michigan, Arizona and Georgia and other states,” Giuliani wrote.\n\n“Read all about Dominion and Smartmatic voting companies and you’ll soon understand how pervasive this Democrat electoral fraud is, and why there’s no way in the world the 2020 Presidential election was either free or fair. #MAGA @realDonaldTrump #AmericaFirst #Dobbs,” Dobbs wrote.\n\nBroadcast 5: Jeanine Pirro interviews Powell\n\nThe broadcast: “Justice with Judge Jeanine” on November 14, 2020.\n\nWhat they alleged: Election fraud, algorithm flips, Venezuela ties.\n\nKey false quote: “It was created for the express purpose of being able to alter votes and secure the reelection of Hugo Chavez and then Maduro. They’ve used it in Argentina,” Powell said. “There is an American citizen who has exported it to other countries and it is one huge, huge criminal conspiracy that should be investigated by military intelligence for its national security implications.”\n\n“Yes. And hopefully the Department of Justice, but who knows anymore,” Pirro said.\n\nBroadcast 6: Bartiromo previews interview with Powell and Giuliani\n\nThe broadcast: “Fox & Friends Sunday” on November 15, 2020.\n\nWhat they alleged: Election fraud, algorithm flips, Venezuela ties, kickbacks.\n\nKey false quote: “Sidney Powell is also talking about potential kickbacks that government officials, who were asked to use Dominion, actually also enjoyed benefits to their families,” Bartiromo said. “We’re going to talk about that coming up as well.”\n\nBroadcast 7: Bartiromo interviews Giuliani and Powell\n\nThe broadcast: “Sunday Morning Futures” on November 15, 2020.\n\nWhat they alleged: Election fraud, algorithm flips, Venezuela ties, kickbacks.\n\nKey false quote: “We have sworn witness testimony of why the software was designed. It was designed to rig elections … We have so much evidence, I feel like it’s coming in through a fire hose,” Powell said.\n\n“Wow,” Bartiromo said.\n\nBroadcast 8: Dobbs interviews Powell\n\nThe broadcast: “Lou Dobbs Tonight” on November 16, 2020.\n\nWhat they alleged: Election fraud, algorithm flips, Venezuela ties.\n\nKey false quote: “I’ve just gotten some stunning evidence from a firsthand witness, a high-ranking military officer, who was present when Smartmatic was designed in a way that – and I’m going to just read to you some of these statements, if you don’t mind, so I get them exactly right,” Powell said.\n\n“Sure,” Dobbs said.\n\nPowell continued, “From the affidavit, (Smartmatic was) ‘designed in a way that the system could change the vote of each voter without being detected.’”\n\nPowell also incorrectly claimed that Smartmatic owns Dominion.\n\nBroadcast 9: Dobbs interviews Giuliani\n\nStatements from Rudy Giuliani, the former New York City Mayor and attorney to President Donald Trump, are at issue in six of the 20 broadcasts. Roy Rochlin/Getty Images\n\nThe broadcast: “Lou Dobbs Tonight” on November 18, 2020.\n\nWhat they alleged: Election fraud, algorithm flips, Venezuela ties.\n\nKey false quote: “But I mean just the mere fact that we have a foreign country, we had this in a foreign country, done by friends of an enemy of the United States, Maduro, is outrageous and has to stop immediately,” Giuliani said.\n\n“It’s outrageous,” Dobbs said.\n\nBroadcast 10: Dobbs interviews Powell\n\nFox Business host Lou Dobbs conducts a phone interview with pro-Trump lawyer Sidney Powell during the November 19, 2020, edition of \"Lou Dobbs Tonight.\" Fox News/court filings\n\nThe broadcast: “Lou Dobbs Tonight” on November 19, 2020.\n\nWhat they alleged: Election fraud, algorithm flips, Venezuela ties.\n\nKey false quote: “Let me put it this way, there are thousands of people in federal prisons on far less evidence of criminal conduct than we have already against the Smartmatic and Dominion Systems companies,” Powell said.\n\nBroadcast 11: Pirro monologue\n\nJeanine Pirro speaks during 2022 FOX Nation Patriot Awards on November 17, 2022. Jason Koerner/Getty Images\n\nThe broadcast: “Justice with Judge Jeanine” on November 21, 2020.\n\nWhat they alleged: Election fraud, algorithm flips, Venezuela ties.\n\nKey false quote: “The President’s lawyers alleging a company called Dominion, which they say started in Venezuela with Cuban money, and with the assistance of Smartmatic software, a backdoor is capable of flipping votes,” Pirro said.\n\nBroadcast 12: Dobbs interviews Powell\n\nThe broadcast: “Lou Dobbs Tonight” on November 24, 2020.\n\nWhat they alleged: Election fraud, algorithm flips, Venezuela ties.\n\nKey false quote: “We are just continuing to be inundated by evidence of all the frauds here and every manner and means of fraud you could possibly think of,” Powell said.\n\n“I think many Americans have given no thought to electoral fraud that would be perpetrated through electronic voting; that is, these machines, these electronic voting companies, including Dominion, prominently Dominion, at least in the suspicions of a lot of Americans,” Dobbs said.\n\nBroadcast 13: Dobbs interview with Powell\n\nThe broadcast: “Lou Dobbs Tonight” on November 30, 2020.\n\nWhat they alleged: Election fraud, algorithm flips, kickbacks.\n\nKey false quote: “Different states shaved different amounts of votes, or the system was set up to shave and flip different votes in different states,” Powell said. “Some people were targeted as individual candidates. It’s really the most massive and historical egregious fraud the world has ever seen.”\n\nBroadcast 14: Sean Hannity interviews Powell\n\nThe broadcast: “Hannity” on November 30, 2020.\n\nWhat they alleged: Election fraud and algorithm flips.\n\nKey false quote: “The machine ran an algorithm that shaved votes from Trump and awarded them to Biden,” Powell said. “They used the machines to trash large batches of votes that should have been awarded to President Trump. And they used a machine to inject and add massive quantities of votes for Mr. Biden.”\n\nBroadcast 15: Dobbs interviews Phil Waldron\n\nThe broadcast: “Lou Dobbs Tonight” on December 4, 2020.\n\nWhat they alleged: Election fraud and algorithm flips.\n\nKey false quote: “Dominion Voting Systems, you have described it with algorithms which were designed to be inaccurate rather than to be a secure system,” Dobbs said.\n\n“Give us your sense of who is driving all of this,” Dobbs asked Phil Waldron, a Trump supporter who worked with Powell and others to spread conspiracy theories about the 2020 election.\n\nBroadcast 16: Tweet from Dobbs\n\nThe broadcast: Dobbs tweet with embedded document on December 10, 2020.\n\nWhat they alleged: Election fraud and algorithm flips.\n\nKey false quote: “The 2020 Election is a cyber Pearl Harbor,” Dobbs wrote, embedding a document.\n\n“We have technical presentations that prove there is an embedded controller in every Dominion machine, that allows an election supervisor to move votes from one candidate to another,” the document stated.\n\nBroadcast 17: Dobbs interviews Powell\n\nThe broadcast: “Lou Dobbs Tonight” on December 10, 2020.\n\nWhat they alleged: Election fraud, algorithm flips, Venezuela ties.\n\nKey false quote: “Let me make you an offer, very straightforwardly,” Dobbs said. “We will gladly put forward your evidence that supports your claim that this was a Cyber Pearl Harbor. We have tremendous evidence already … of fraud in this election, but I will be glad to put forward on this broadcast whatever evidence you have, and we’ll be glad to do it immediately.”\n\nBroadcast 18: Tweet from Dobbs\n\nThe broadcast: Dobbs tweet with embedded video of Powell interview on December 10, 2020.\n\nWhat they alleged: Election fraud.\n\nKey false quote: “Cyber Pearl Harbor: @SidneyPowell1 reveals groundbreaking new evidence indicating our Presidential election came under massive cyber-attack orchestrated with the help of Dominion, Smartmatic, and foreign adversaries. #MAGA #AmericaFirst #Dobbs,” Dobbs wrote.\n\nBroadcast 19: Fox interviews Giuliani\n\nThe broadcast: “Fox & Friends” with hosts Will Cain, Pete Hegseth and Rachel Campos-Duffy on December 12, 2020.\n\nWhat they alleged: Election fraud.\n\nKey false quote: “We have a machine, the Dominion machine, that’s as filled with holes as Swiss cheese and was developed to steal elections, and being used in the states that are involved,” Giuliani said.\n\nBroadcast 20: Tucker Carlson interviews Mike Lindell\n\nFox News host Tucker Carlson interviews Trump ally Mike Lindell during the January 26, 2021, edition of \"Tucker Carlson Tonight.\" Fox News/court filings\n\nThe broadcast: “Tucker Carlson Tonight” on January 26, 2021.\n\nWhat they alleged: Election fraud.\n\nKey false quote: “Every outlet in the country, they go, ‘Mike Lindell, there’s no evidence, and he’s making fraudulent statements.’ No. I have the evidence. I dare people to put it on. I dare Dominion to sue me because then it will get out faster. So, this is – you know, they don’t – they don’t want to talk about it,” Lindell said.\n\n“No, they don’t,” Carlson said."
        },
        {
          "link": "https://www.cnn.com/2023/04/18/media/fox-dominion-settlement/index.html",
          "published": "2023-04-19T09:28:17",
          "title": "Fox News settles with Dominion for $787 million, averting defamation trial over its 2020 election lies",
          "text": "Wilmington, Delaware CNN —\n\nFox News reached a last-second settlement with Dominion Voting Systems on Tuesday as the case raced toward opening statements, paying more than $787 million to end a colossal two-year legal battle that publicly shredded the right-wing network’s credibility.\n\nFox News’ $787.5 million settlement with Dominion Voting Systems is the largest publicly known defamation settlement in US history involving a media company.\n\nThe deal was announced hours after the jury was sworn in at the Delaware Superior Court. Rumors of a settlement swirled in the courthouse when, after a lunch break, the proceedings dramatically ground to a halt for nearly three hours with no explanation, while the parties apparently hammered out an accord.\n\nAttorneys representing Dominion Voting Systems, leave the New Castle County Courthouse in Wilmington, Del., after the defamation lawsuit by Dominion Voting Systems against Fox News was settled just as the jury trial was set to begin, Tuesday, April 18, 2023. Julio Cortez/AP\n\n“The parties have resolved their case,” Judge Eric Davis said, before dismissing the 12-member jury, crediting them with giving the parties an impetus to reach a settlement, effusively praising the lawyers from both sides, and gaveling out the so-called media “trial of the century” before it could even begin.\n\nThe groundbreaking settlement “represents vindication and accountability,” Dominion lawyer Justin Nelson said. “For our democracy to endure for another 250 years, and hopefully much longer, we must share a commitment to facts… Today represents a ringing endorsement for truth and for democracy.”\n\nThe right-wing network said in a statement that it “acknowledge[s] the Court’s rulings finding certain claims about Dominion to be false,” referring to Davis’ recent ruling that 20 Fox News broadcasts from late 2020 contained blatantly untrue assertions that Dominion rigged the presidential election. But Fox won’t have to admit on-air that it spread lies about Dominion, a Dominion representative told CNN.\n\nThe $787.5 million payout is roughly half of the $1.6 billion that Dominion initially sought, though it is nearly 10 times the company’s valuation from 2018, and roughly eight times its annual revenue in 2021, according to court filings.\n\nFox avoids painful six-week trial\n\nThe last-minute agreement means the closely watched case is over and won’t proceed to trial. By settling with Dominion, influential Fox News executives and prominent on-air personalities will be spared from testifying about their 2020 election coverage, which was filled with lies about voter fraud.\n\nFox lawyers leave the courthouse after Dominion Voting Systems and Fox settled a defamation lawsuit for $787.5 million, avoiding trial, over Fox's coverage of debunked election-rigging claims, in Delaware Superior Court, in Wilmington, Delaware, U.S. April 18, 2023. Eduardo Munoz/Reuters\n\nThe witness list included Fox Corporation chairman Rupert Murdoch, his CEO son Lachlan Murdoch, and top Fox hosts like Sean Hannity and Tucker Carlson. Damning emails, texts, and deposition testimony made public during the case revealed that these figures, and many others at Fox, privately said in 2020 that the vote-rigging claims against Dominion were asinine. But the lies were spread on-air anyway.\n\nRupert Murdoch thought the election denialism was “really crazy,” even as Fox personalities peddled those same claims to millions of viewers. Carlson said he “passionately” hates Donald Trump, whose presidency was a “disaster.” Fox hosts, producers, fact-checkers, and senior executives privately said in the on-air claims of a stolen election were “kooky,” “dangerously reckless” and “mind-blowingly nuts.”\n\nThese revelations generated months of blistering headlines for Fox as the case moved toward trial. By settling now, Fox deprived Dominion a chance to further expose its dishonesty with a weeks-long trial.\n\n“This settlement reflects Fox’s continued commitment to the highest journalistic standards,” Fox said in a statement Tuesday. “We are hopeful that our decision to resolve this dispute with Dominion amicably, instead of the acrimony of a divisive trial, allows the country to move forward from these issues.”\n\nFox News and Fox Corporation – its parent company, which was also a defendant – maintain they never defamed Dominion, and say the case was a meritless assault on First Amendment press freedoms.\n\nDramatic days in Delaware\n\nSpeculation of a settlement reached a fever pitch in recent days, especially after the court on Sunday announced a one-day delay to the start of the trial, which was originally set to begin on Monday.\n\nThe jury selection process wrapped up as planned Tuesday morning, and both sides prepped for opening statements. They even briefly tangled over objections to specific slides in their presentations. But when the proceedings didn’t promptly resume after lunch, the chances of a deal seemed to rise by the minute, even though the top lawyers from both sides sat in the courtroom, looking at their phones, and waiting.\n\nThe racially diverse jury of six men and six women was brought back into the court, ready for their front-row seat to a historic trial. But Davis, the judge, instead told the panel they helped spur a settlement.\n\n“Your presence here, short compared to what you thought, and uneventful in a certain sense, was extremely important,” Davis said. “Without you, the parties would not have been able to resolve their situation.”\n\nMany on the Dominion side cast the settlement as a victory for democracy and for truth itself.\n\n“Fox has admitted to telling lies about Dominion that caused enormous damage to my company, our employees, and the customers that we serve,” Dominion CEO John Poulos said Tuesday outside court.\n\nWhile the Dominion case is now over, Fox News is still facing a second major defamation lawsuit from Smartmatic, another voting technology company that was similarly smeared on Fox News’ shows after the 2020 election. That case is still in the discovery process, and a trial isn’t expected anytime soon.\n\nFor its part, Dominion still has pending lawsuits against right-wing TV networks Newsmax and OAN, as well as against Trump allies Rudy Giuliani, Sidney Powell and Mike Lindell. They all deny wrongdoing.\n\nCNN’s Liam Reilly and Danny Freeman contributed to this story."
        },
        {
          "link": "https://www.cnn.com/videos/politics/2023/04/18/jake-tapper-dominion-lawsuit-settlement-fox-news-statement-lead-vpx.cnn",
          "published": "2023-04-18T22:17:44",
          "title": "‘Difficult to say with a straight face’: Tapper reacts to Fox News’ statement on settlement",
          "text": "1. How relevant is this ad to you?\n\nVideo player was slow to load content Video content never loaded Ad froze or did not finish loading Video content did not start after ad Audio on ad was too loud Other issues"
        }
      ]
    },
    "nytimes": {
      "rss": "https://rss.nytimes.com/services/xml/rss/nyt/HomePage.xml",
      "link": "https://www.nytimes.com",
      "articles": [
        {
          "link": "https://www.nytimes.com/2025/06/15/world/middleeast/diplomacy-with-iran-is-damaged-not-dead.html",
          "published": "2025-06-15T16:13:18",
          "title": "Diplomacy With Iran Is Damaged, Not Dead",
          "text": "Prime Minister Benjamin Netanyahu of Israel has argued that the attack on Iran was to stop Tehran from developing a nuclear weapon, even as a sixth round of talks to prevent that very outcome was scheduled between the United States and Iran.\n\nWhile Israel argues that it had to strike now to prevent an Iranian race to bomb, American and European judgments were that Iran was still many months away from building a bomb and has not yet decided to do so.\n\nMr. Netanyahu believes that a deal that would allow Iran to enrich uranium would mean a nuclear-armed Iran in the future, and he has been bent on preventing that outcome. He has apparently judged that a U.S.-Iran deal would have kept him from his goal of destroying Iran’s nuclear program, and, perhaps, he hopes, bringing about the fall of the Islamic Republic.\n\nBut Israel is considered highly unlikely to meet the goal of destroying Iran’s nuclear program without active American involvement, which Mr. Trump has so far resisted.\n\nThe president continues to say that he wants negotiations to succeed. He seems to believe that the attack will bring Iran back to the table in a weaker and more conciliatory position, ready to accept his latest demand that it halt all enrichment of uranium. But Iran insists that it has the right to enrich for civilian uses under the Nuclear Nonproliferation Treaty.\n\nMr. Trump clearly sees the war as a form of diplomacy. On Friday, he wrote: “Two months ago I gave Iran a 60-day ultimatum to ‘make a deal.’ They should have done it! Today is day 61. I told them what to do, but they just couldn’t get there. Now they have, perhaps, a second chance!”\n\nEarly on Sunday, Mr. Trump warned Iran against attacking American forces in a message on Truth Social. “However, we can easily get a deal done between Iran and Israel, and end this bloody conflict,” he said. Whether Israel would accept such a deal, if Iran is allowed to enrich at all, is an open question.\n\nAt the same time, Mr. Trump, who has said he knew about the Israeli attack beforehand, has done nothing in public to restrain the Israelis. When Washington announced last week that the talks would continue on Sunday, it is not clear whether it knew when Israel would attack, but the Iranians are convinced that Washington was complicit in trying to fool them into believing that any Israeli attack would come afterward.\n\nA quick deal now that would give up enrichment would be seen as a surrender, said Vali Nasr, a professor at the Johns Hopkins School of Advanced International Studies who served in the State Department during the Obama administration. That could make the Iranian government more vulnerable at home. “They won’t give up enrichment, not this easily,” he said. “They’re not going to surrender.”"
        },
        {
          "link": "https://www.nytimes.com/2025/06/15/business/energy-environment/oil-prices-israel-iran.html",
          "published": "2025-06-15T23:36:40",
          "title": "Oil Prices Climb Further After Israel Strikes Iran’s Energy Assets",
          "text": "American consumers are likely to start feeling the impact of the escalating conflict between Israel and Iran, as more expensive oil causes prices at the gas pump to rise.\n\nU.S. oil prices climbed about 3 percent as markets opened on Sunday evening, hovering around $75 a barrel, after Israel struck several Iranian oil and gas facilities over the weekend. Those included one of the world’s largest natural gas fields, known as South Pars; Tehran’s main gas depot; and an oil refinery.\n\nBut the strikes have not yet meaningfully affected the flow of oil in the region, which is a key energy transit hub, said Tom Kloza, chief market analyst for Turner, Mason & Company, an energy consulting firm.\n\nSunday’s price movement added to a 12 percent gain in oil prices from Monday to Friday. Last week’s price increase alone could cause gasoline prices to rise about 20 cents a gallon in the coming weeks, according to ClearView Energy Partners, a Washington research firm."
        },
        {
          "link": "https://www.nytimes.com/2025/06/15/us/lawmakers-home-addresses.html",
          "published": "2025-06-15T22:58:12",
          "title": "Many Lawmakers Share Their Home Addresses. Political Violence Is Changing That.",
          "text": "When an assassin visited the homes of two Minnesota lawmakers on Saturday, it exposed the longstanding tension between a public official’s accessibility and their security.\n\nBoth State Representative Melissa Hortman, who along with her husband Mark was killed, and State Senator John A. Hoffman, who along with his wife Yvette was wounded, readily shared their home addresses with constituents. Ms. Hortman’s address was listed on her campaign website, and Mr. Hoffman’s address had been listed on his official legislative webpage, a common practice in many states.\n\nBut in the hours after the shootings, while police officers were still searching for the assassin, lawmakers across the country began to rethink their approach to privacy and safety. The Michigan State Police held security briefings for legislators. The police in Fairfax County, Va., increased patrols around lawmakers’ homes. And in North Dakota, officials decided by midday Saturday to scrub home addresses from legislator biography pages.\n\n“In light of the tragedy in Minnesota, we quickly decided to remove all addresses until our leaders have time to assess the proper balance between transparency and safety of our elected officials,” John D. Bjornson, the director of the North Dakota Legislative Council, said in an email.\n\nIn interviews with lawmakers across the country, some said sharing their home address helped reassure constituents that they were part of the community and could be easily reached. But unlike governors and presidents, most state lawmakers have no special security protection when they are away from work. The country’s coarsening public discourse has left them to weigh difficult trade-offs.\n\n“Part of the reason why my address is easily found is to make it clear that I actually live in my district,” said Stephanie Sawyer Clayton, a Democratic state representative in Kansas. “If you have a P.O. box, you don’t look authentic, right?”\n\n“But for authenticity,” Ms. Clayton added, “you kind of pay that price of vulnerability.”\n\nThough recent political violence has cut across party lines, both Minnesota lawmakers who were shot were Democrats, and the suspected assassin was said to be carrying a list of targets that was filled with more Democrats.\n\nIn Ohio, State Senator Casey Weinstein thanked his state’s Republican governor on Saturday for increasing security for lawmakers, a decision that the governor’s office declined to confirm.\n\n“Honestly I’m struggling with this news,” Mr. Weinstein, a Democrat, wrote on Facebook after the Minnesota attacks. “I’m worried for my family. I worry I’m putting them in harm’s way by being in office. It’s a terrible feeling.”\n\nIn Michigan, State Representative Karen Whitsett said she had no plans to remove her home address from her campaign website. Having it there, she said, showed constituents in her Detroit-based district that “I’m right here, I’m with you” and “that I’m not disconnected.”\n\nBut Ms. Whitsett, a Democrat who sometimes votes with Republicans in her state’s closely divided Legislature, said she had faced threats over the years.\n\nAfter the Minnesota attack, Ms. Whitsett said she decided to seek a permit to carry a concealed gun. Ms. Whitsett said she previously had such a permit and used it to carry a weapon inside the State Capitol, where she does not always feel safe. She plans to do so again.\n\n“I’m not going to depend on security,” said Ms. Whitsett, who on Sunday attended a video briefing on legislator safety that the Michigan State Police scheduled after the Minnesota attacks.\n\nAnother Michigan state representative, Bill G. Schuette, a Republican, said he had purchased a home security system in recent years after angry people showed up at his house on multiple occasions. His address, he said, was required to be public under state law.\n\n“You sign up in this business to be accessible to your constituents and to be a voice that’s always listening,” Mr. Schuette said. “You really have to be grateful and thankful for our brave women and men in law enforcement, and hopeful, too, that people will try and respect some personal boundaries.”\n\nLawmakers, of course, are hardly alone in having personal information widely exposed online, and even legislators who do not actively publish their addresses might be easily found with a quick Google search.\n\nSome legislators also bristled at the idea that they might receive extra protections. In Michigan, Ms. Whitsett said many of her constituents live with a daily threat of violence that politicians have not done enough to address. And in Kansas, Ms. Clayton said that “I am no different or no more special than any other constituent of mine who goes to work and faces the risk of getting hurt or killed on the job.”\n\nWhen lawmakers want to limit what personal information is available about them, there are limiting factors. Some campaign finance forms and other public documents list politicians’ addresses and phone numbers. And because elected officials must generally live in the districts they represent, there is a level of accountability in the public knowing where a lawmaker claims to live.\n\nIn North Dakota, State Senator Ryan Braunberger said he had been comfortable with his address being posted online before state officials decided to take it down this weekend. Mr. Braunberger, the Democratic leader in his chamber, said he had heard from the police in his home city of Fargo that they would be increasing patrols near legislators’ homes following the shootings near Minneapolis, about three hours away by car.\n\n“Honestly I don’t feel unsafe today,” he said. “But I also refuse to live in that world of fear, because it only encourages the perpetrators. Because that’s what they’re trying to do, is incite fear.”"
        },
        {
          "link": "https://www.nytimes.com/live/2025/06/15/us/minnesota-shootings-manhunt/how-a-manhunt-works-according-to-security-experts",
          "published": "2025-06-15T20:37:34",
          "title": "Live Updates: Police Scour Rural Minnesota Area Where Shooting Suspect’s Belongings Were Found",
          "text": "When an assassin visited the homes of two Minnesota lawmakers on Saturday, it exposed the longstanding tension between a public official’s accessibility and their security.\n\nBoth State Representative Melissa Hortman, who along with her husband Mark was killed, and State Senator John A. Hoffman, who along with his wife Yvette was wounded, readily shared their home addresses with constituents. Ms. Hortman’s address was listed on her campaign website, and Mr. Hoffman’s address had been listed on his official legislative webpage, a common practice in many states.\n\nBut in the hours after the shootings, while police officers were still searching for the assassin, lawmakers across the country began to rethink their approach to privacy and safety. The Michigan State Police held security briefings for legislators. The police in Fairfax County, Va., increased patrols around lawmakers’ homes. And in North Dakota, officials decided by midday Saturday to scrub home addresses from legislator biography pages.\n\n“In light of the tragedy in Minnesota, we quickly decided to remove all addresses until our leaders have time to assess the proper balance between transparency and safety of our elected officials,” John D. Bjornson, the director of the North Dakota Legislative Council, said in an email.\n\nIn interviews with lawmakers across the country, some said sharing their home address helped reassure constituents that they were part of the community and could be easily reached. But unlike governors and presidents, most state lawmakers have no special security protection when they are away from work. The country’s coarsening public discourse has left them to weigh difficult trade-offs.\n\n“Part of the reason why my address is easily found is to make it clear that I actually live in my district,” said Stephanie Sawyer Clayton, a Democratic state representative in Kansas. “If you have a P.O. box, you don’t look authentic, right?”\n\n“But for authenticity,” Ms. Clayton added, “you kind of pay that price of vulnerability.”\n\nThough recent political violence has cut across party lines, both Minnesota lawmakers who were shot were Democrats, and the suspected assassin was said to be carrying a list of targets that was filled with more Democrats.\n\nIn Ohio, State Senator Casey Weinstein thanked his state’s Republican governor on Saturday for increasing security for lawmakers, a decision that the governor’s office declined to confirm.\n\n“Honestly I’m struggling with this news,” Mr. Weinstein, a Democrat, wrote on Facebook after the Minnesota attacks. “I’m worried for my family. I worry I’m putting them in harm’s way by being in office. It’s a terrible feeling.”\n\nIn Michigan, State Representative Karen Whitsett said she had no plans to remove her home address from her campaign website. Having it there, she said, showed constituents in her Detroit-based district that “I’m right here, I’m with you” and “that I’m not disconnected.”\n\nBut Ms. Whitsett, a Democrat who sometimes votes with Republicans in her state’s closely divided Legislature, said she had faced threats over the years.\n\nAfter the Minnesota attack, Ms. Whitsett said she decided to seek a permit to carry a concealed gun. Ms. Whitsett said she previously had such a permit and used it to carry a weapon inside the State Capitol, where she does not always feel safe. She plans to do so again.\n\n“I’m not going to depend on security,” said Ms. Whitsett, who on Sunday attended a video briefing on legislator safety that the Michigan State Police scheduled after the Minnesota attacks.\n\nAnother Michigan state representative, Bill G. Schuette, a Republican, said he had purchased a home security system in recent years after angry people showed up at his house on multiple occasions. His address, he said, was required to be public under state law.\n\n“You sign up in this business to be accessible to your constituents and to be a voice that’s always listening,” Mr. Schuette said. “You really have to be grateful and thankful for our brave women and men in law enforcement, and hopeful, too, that people will try and respect some personal boundaries.”\n\nLawmakers, of course, are hardly alone in having personal information widely exposed online, and even legislators who do not actively publish their addresses might be easily found with a quick Google search.\n\nSome legislators also bristled at the idea that they might receive extra protections. In Michigan, Ms. Whitsett said many of her constituents live with a daily threat of violence that politicians have not done enough to address. And in Kansas, Ms. Clayton said that “I am no different or no more special than any other constituent of mine who goes to work and faces the risk of getting hurt or killed on the job.”\n\nWhen lawmakers want to limit what personal information is available about them, there are limiting factors. Some campaign finance forms and other public documents list politicians’ addresses and phone numbers. And because elected officials must generally live in the districts they represent, there is a level of accountability in the public knowing where a lawmaker claims to live.\n\nIn North Dakota, State Senator Ryan Braunberger said he had been comfortable with his address being posted online before state officials decided to take it down this weekend. Mr. Braunberger, the Democratic leader in his chamber, said he had heard from the police in his home city of Fargo that they would be increasing patrols near legislators’ homes following the shootings near Minneapolis, about three hours away by car.\n\n“Honestly I don’t feel unsafe today,” he said. “But I also refuse to live in that world of fear, because it only encourages the perpetrators. Because that’s what they’re trying to do, is incite fear.”"
        }
      ]
    }
  }
}